app/controllers/tempatures_controller.rb

  def add
    @tempature = Tempature.create({:cottage_id => params[:cottage_id],
        :temp => params[:temp].tr(',','.')})
---
INSERT INTO "tempatures" ("temp", "created_at", "updated_at", "cottage_id") VALUES(NULL, '2010-01-03 12:19:32', '2010-01-03 12:19:32', NULL)